app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(post_params)
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Chemistry"], ["room_number", 99]]

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(post_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Grover Cleveland"], ["updated_at", "2020-09-25 19:26:00.427643"], ["id", 1]]