app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Steven "], ["updated_at", "2020-09-25 19:25:36.767232"], ["id", 3]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(post_params)